app/views/gossips/new.html.erb


     <input type="hidden" name="user" value=<%= User.first.id %>>
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]