app/views/gossips/show.html.erb


<h1>Here is the <%= @gossip.user.first_name %> <%= @gossip.user.last_name %>'s' gossip</h1>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]