app/views/cities/show.html.erb

  <div class="row row-cols-5 d-flex justify-content-center">
    <% Gossip.all.each do |gossip| %>
---
SELECT "gossips".* FROM "gossips"

          <div class="card-body">
            <h5 class="card-title"><%= gossip.user.first_name %></h5>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 49], ["LIMIT", 1]]